Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinElementsMultiPlaneError Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinElementsMultiPlaneError { get; }
Public Shared ReadOnly Property CannotJoinElementsMultiPlaneError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinElementsMultiPlaneError {
	FailureDefinitionId^ get ();
}
static member CannotJoinElementsMultiPlaneError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace